results/pass.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: slo-test.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 20 looping VUs for 1m0s (gracefulStop: 30s)


running (0m01.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 20 VUs  0m01.0s/1m0s

running (0m02.0s), 20/20 VUs, 20 complete and 0 interrupted iterations
default   [   3% ] 20 VUs  0m02.0s/1m0s

running (0m03.0s), 20/20 VUs, 40 complete and 0 interrupted iterations
default   [   5% ] 20 VUs  0m03.0s/1m0s

running (0m04.0s), 20/20 VUs, 54 complete and 0 interrupted iterations
default   [   7% ] 20 VUs  0m04.0s/1m0s

running (0m05.0s), 20/20 VUs, 60 complete and 0 interrupted iterations
default   [   8% ] 20 VUs  0m05.0s/1m0s

running (0m06.0s), 20/20 VUs, 80 complete and 0 interrupted iterations
default   [  10% ] 20 VUs  0m06.0s/1m0s

running (0m07.0s), 20/20 VUs, 100 complete and 0 interrupted iterations
default   [  12% ] 20 VUs  0m07.0s/1m0s

running (0m08.0s), 20/20 VUs, 116 complete and 0 interrupted iterations
default   [  13% ] 20 VUs  0m08.0s/1m0s

running (0m09.0s), 20/20 VUs, 121 complete and 0 interrupted iterations
default   [  15% ] 20 VUs  0m09.0s/1m0s

running (0m10.0s), 20/20 VUs, 140 complete and 0 interrupted iterations
default   [  17% ] 20 VUs  0m10.0s/1m0s

running (0m11.0s), 20/20 VUs, 160 complete and 0 interrupted iterations
default   [  18% ] 20 VUs  0m11.0s/1m0s

running (0m12.0s), 20/20 VUs, 179 complete and 0 interrupted iterations
default   [  20% ] 20 VUs  0m12.0s/1m0s

running (0m13.0s), 20/20 VUs, 181 complete and 0 interrupted iterations
default   [  22% ] 20 VUs  0m13.0s/1m0s

running (0m14.0s), 20/20 VUs, 200 complete and 0 interrupted iterations
default   [  23% ] 20 VUs  0m14.0s/1m0s

running (0m15.0s), 20/20 VUs, 220 complete and 0 interrupted iterations
default   [  25% ] 20 VUs  0m15.0s/1m0s

running (0m16.0s), 20/20 VUs, 239 complete and 0 interrupted iterations
default   [  27% ] 20 VUs  0m16.0s/1m0s

running (0m17.0s), 20/20 VUs, 246 complete and 0 interrupted iterations
default   [  28% ] 20 VUs  0m17.0s/1m0s

running (0m18.0s), 20/20 VUs, 261 complete and 0 interrupted iterations
default   [  30% ] 20 VUs  0m18.0s/1m0s

running (0m19.0s), 20/20 VUs, 280 complete and 0 interrupted iterations
default   [  32% ] 20 VUs  0m19.0s/1m0s

running (0m20.0s), 20/20 VUs, 299 complete and 0 interrupted iterations
default   [  33% ] 20 VUs  0m20.0s/1m0s

running (0m21.0s), 20/20 VUs, 313 complete and 0 interrupted iterations
default   [  35% ] 20 VUs  0m21.0s/1m0s

running (0m22.0s), 20/20 VUs, 321 complete and 0 interrupted iterations
default   [  37% ] 20 VUs  0m22.0s/1m0s

running (0m23.0s), 20/20 VUs, 340 complete and 0 interrupted iterations
default   [  38% ] 20 VUs  0m23.0s/1m0s

running (0m24.0s), 20/20 VUs, 360 complete and 0 interrupted iterations
default   [  40% ] 20 VUs  0m24.0s/1m0s

running (0m25.0s), 20/20 VUs, 375 complete and 0 interrupted iterations
default   [  42% ] 20 VUs  0m25.0s/1m0s

running (0m26.0s), 20/20 VUs, 384 complete and 0 interrupted iterations
default   [  43% ] 20 VUs  0m26.0s/1m0s

running (0m27.0s), 20/20 VUs, 400 complete and 0 interrupted iterations
default   [  45% ] 20 VUs  0m27.0s/1m0s

running (0m28.0s), 20/20 VUs, 419 complete and 0 interrupted iterations
default   [  47% ] 20 VUs  0m28.0s/1m0s

running (0m29.0s), 20/20 VUs, 437 complete and 0 interrupted iterations
default   [  48% ] 20 VUs  0m29.0s/1m0s

running (0m30.0s), 20/20 VUs, 447 complete and 0 interrupted iterations
default   [  50% ] 20 VUs  0m30.0s/1m0s

running (0m31.0s), 20/20 VUs, 461 complete and 0 interrupted iterations
default   [  52% ] 20 VUs  0m31.0s/1m0s

running (0m32.0s), 20/20 VUs, 480 complete and 0 interrupted iterations
default   [  53% ] 20 VUs  0m32.0s/1m0s

running (0m33.0s), 20/20 VUs, 497 complete and 0 interrupted iterations
default   [  55% ] 20 VUs  0m33.0s/1m0s

running (0m34.0s), 20/20 VUs, 510 complete and 0 interrupted iterations
default   [  57% ] 20 VUs  0m34.0s/1m0s

running (0m35.0s), 20/20 VUs, 522 complete and 0 interrupted iterations
default   [  58% ] 20 VUs  0m35.0s/1m0s

running (0m36.0s), 20/20 VUs, 540 complete and 0 interrupted iterations
default   [  60% ] 20 VUs  0m36.0s/1m0s

running (0m37.0s), 20/20 VUs, 558 complete and 0 interrupted iterations
default   [  62% ] 20 VUs  0m37.0s/1m0s

running (0m38.0s), 20/20 VUs, 572 complete and 0 interrupted iterations
default   [  63% ] 20 VUs  0m38.0s/1m0s

running (0m39.0s), 20/20 VUs, 584 complete and 0 interrupted iterations
default   [  65% ] 20 VUs  0m39.0s/1m0s

running (0m40.0s), 20/20 VUs, 600 complete and 0 interrupted iterations
default   [  67% ] 20 VUs  0m40.0s/1m0s

running (0m41.0s), 20/20 VUs, 620 complete and 0 interrupted iterations
default   [  68% ] 20 VUs  0m41.0s/1m0s

running (0m42.0s), 20/20 VUs, 634 complete and 0 interrupted iterations
default   [  70% ] 20 VUs  0m42.0s/1m0s

running (0m43.0s), 20/20 VUs, 645 complete and 0 interrupted iterations
default   [  72% ] 20 VUs  0m43.0s/1m0s

running (0m44.0s), 20/20 VUs, 661 complete and 0 interrupted iterations
default   [  73% ] 20 VUs  0m44.0s/1m0s

running (0m45.0s), 20/20 VUs, 679 complete and 0 interrupted iterations
default   [  75% ] 20 VUs  0m45.0s/1m0s

running (0m46.0s), 20/20 VUs, 695 complete and 0 interrupted iterations
default   [  77% ] 20 VUs  0m46.0s/1m0s

running (0m47.0s), 20/20 VUs, 706 complete and 0 interrupted iterations
default   [  78% ] 20 VUs  0m47.0s/1m0s

running (0m48.0s), 20/20 VUs, 723 complete and 0 interrupted iterations
default   [  80% ] 20 VUs  0m48.0s/1m0s

running (0m49.0s), 20/20 VUs, 739 complete and 0 interrupted iterations
default   [  82% ] 20 VUs  0m49.0s/1m0s

running (0m50.0s), 20/20 VUs, 758 complete and 0 interrupted iterations
default   [  83% ] 20 VUs  0m50.0s/1m0s

running (0m51.0s), 20/20 VUs, 769 complete and 0 interrupted iterations
default   [  85% ] 20 VUs  0m51.0s/1m0s

running (0m52.0s), 20/20 VUs, 783 complete and 0 interrupted iterations
default   [  87% ] 20 VUs  0m52.0s/1m0s

running (0m53.0s), 20/20 VUs, 799 complete and 0 interrupted iterations
default   [  88% ] 20 VUs  0m53.0s/1m0s

running (0m54.0s), 20/20 VUs, 819 complete and 0 interrupted iterations
default   [  90% ] 20 VUs  0m54.0s/1m0s

running (0m55.0s), 20/20 VUs, 832 complete and 0 interrupted iterations
default   [  92% ] 20 VUs  0m55.0s/1m0s

running (0m56.0s), 20/20 VUs, 844 complete and 0 interrupted iterations
default   [  93% ] 20 VUs  0m56.0s/1m0s

running (0m57.0s), 20/20 VUs, 861 complete and 0 interrupted iterations
default   [  95% ] 20 VUs  0m57.0s/1m0s

running (0m58.0s), 20/20 VUs, 879 complete and 0 interrupted iterations
default   [  97% ] 20 VUs  0m58.0s/1m0s

running (0m59.0s), 20/20 VUs, 895 complete and 0 interrupted iterations
default   [  98% ] 20 VUs  0m59.0s/1m0s

running (1m00.0s), 20/20 VUs, 905 complete and 0 interrupted iterations
default   [ 100% ] 20 VUs  1m00.0s/1m0s

running (1m01.0s), 03/20 VUs, 922 complete and 0 interrupted iterations
default ↓ [ 100% ] 20 VUs  1m0s


  █ THRESHOLDS 

    checks
    ✓ 'rate>0.90' rate=98.45%

    http_req_duration{name:cart}
    ✓ 'p(95)<50' p(95)=2.4ms

    http_req_duration{name:report}
    ✓ 'p(95)<450' p(95)=391.46ms

    http_req_failed{name:pay}
    ✓ 'rate<0.08' rate=4.64%


  █ TOTAL RESULTS 

    checks_total.......: 2775   45.364387/s
    checks_succeeded...: 98.45% 2732 out of 2775
    checks_failed......: 1.54%  43 out of 2775

    ✓ cart 200
    ✓ report 200
    ✗ pay 200
      ↳  95% — ✓ 882 / ✗ 43

    HTTP
    http_req_duration..............: avg=102.09ms min=393.66µs med=1.59ms   max=401.17ms p(90)=343.46ms p(95)=372.45ms
      { expected_response:true }...: avg=103.67ms min=393.66µs med=1.6ms    max=401.17ms p(90)=344.32ms p(95)=373.24ms
      { name:cart }................: avg=1.73ms   min=482.79µs med=1.49ms   max=14.1ms   p(90)=2.07ms   p(95)=2.4ms   
      { name:report }..............: avg=303.28ms min=200.46ms med=305.66ms max=401.17ms p(90)=383.2ms  p(95)=391.46ms
    http_req_failed................: 1.54%  43 out of 2775
      { name:pay }.................: 4.64%  43 out of 925
    http_reqs......................: 2775   45.364387/s

    EXECUTION
    iteration_duration.............: avg=1.3s     min=1.2s     med=1.31s    max=1.4s     p(90)=1.38s    p(95)=1.39s   
    iterations.....................: 925    15.121462/s
    vus............................: 3      min=3          max=20
    vus_max........................: 20     min=20         max=20

    NETWORK
    data_received..................: 696 kB 11 kB/s
    data_sent......................: 247 kB 4.0 kB/s



running (1m01.2s), 00/20 VUs, 925 complete and 0 interrupted iterations
default ✓ [ 100% ] 20 VUs  1m0s